In [31]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]}, 
                  columns= ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [32]:
# aggregate

In [33]:
df.groupby('gruplar').mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [34]:
df.groupby('gruplar').aggregate(["min", np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [35]:
# farklı bir kullanım :
# df.groupby('gruplar').aggregate({'degisken1': 'min','degisken2':'max'})

df.groupby('gruplar').aggregate({'degisken1': [min,np.median],'degisken2':[max,np.median]})

        degisken1        degisken2
              min median       max median
gruplar
A              10     16       262    181
B              11     17       253    182
C              33     66       969    651

In [70]:
# grup isimlerini görmek için : 
# g = df.groupby('gruplar')
# g.groups.keys()

df.groupby('gruplar').groups.keys()

dict_keys(['A', 'B', 'C'])